[		{
	"id": "http://zotero.org/users/local/FrGxSZBV/items/347XBBZ5",
	"type": "article",
	"abstract": "Abstract\n          Cellular organization is central to tissue function and homeostasis, influencing development, disease progression, and therapeutic outcomes. The emergence of spatial omics technologies, including spatial transcriptomics and proteomics, has enabled the integration of molecular and histological features within tissues. Analyzing these multimodal data presents unique challenges, including variable resolutions, imperfect tissue alignment, and limited or variable spatial coverage. To address these issues, we introduce CORAL, a probabilistic deep generative model that leverages graph attention mechanisms to learn expressive, integrated representations of multimodal spatial omics data. CORAL deconvolves low-resolution spatial data into high-resolution single-cell profiles and detects functional spatial domains. It also characterizes cell-cell interactions and elucidates disease-relevant spatial features. Validated on synthetic data and experimental datasets, including Stero-CITE-seq data from mouse thymus, and paired CODEX and Visium data from hepatocellular carcinoma, CORAL demonstrates robustness and versatility. In hepatocellular carcinoma, CORAL uncovered key immune cell subsets that drive the failure of response to immunotherapy, highlighting its potential to advance spatial single-cell analyses and accelerate translational research.",
	"DOI": "10.1101/2025.02.01.636038",
	"language": "en",
	"license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
	"publisher": "Bioinformatics",
	"source": "DOI.org (Crossref)",
	"title": "Learning single-cell spatial context through integrated spatial multiomics with CORAL",
	"URL": "http://biorxiv.org/lookup/doi/10.1101/2025.02.01.636038",
	"author": [
		{
			"family": "He",
			"given": "Siyu"
		},
		{
			"family": "Bieniosek",
			"given": "Matthew"
		},
		{
			"family": "<b>Song</b>",
			"given": "Dongyuan"
		},
		{
			"family": "Zhou",
			"given": "Jingtian"
		},
		{
			"family": "Chidester",
			"given": "Benjamin"
		},
		{
			"family": "Wu",
			"given": "Zhenqin"
		},
		{
			"family": "Boen",
			"given": "Joseph"
		},
		{
			"family": "Sharma",
			"given": "Padmanee"
		},
		{
			"family": "Trevino",
			"given": "Alexandro E."
		},
		{
			"family": "Zou",
			"given": "James"
		}
	],
	"accessed": {
		"date-parts": [
			[
				"2025",
				3,
				6
			]
		]
	},
	"issued": {
		"date-parts": [
			[
				"2025",
				2,
				6
			]
		]
	}
},
{
	"id": "http://zotero.org/users/local/FrGxSZBV/items/6W7ATBDX",
	"type": "article",
	"abstract": "Double dipping is a well-known pitfall in single-cell and spatial transcriptomics data analysis: after a clustering algorithm finds clusters as putative cell types or spatial domains, statistical tests are applied to the same data to identify differentially expressed (DE) genes as potential cell-type or spatial-domain markers. Because the genes that contribute to clustering are inherently likely to be identified as DE genes, double dipping can result in false-positive cell-type or spatial-domain markers, especially when clusters are spurious, leading to ambiguously defined cell types or spatial domains. To address this challenge, we propose ClusterDE, a statistical method designed to identify post-clustering DE genes as reliable markers of cell types and spatial domains, while controlling the false discovery rate (FDR) regardless of clustering quality. The core of ClusterDE involves generating synthetic null data as an in silico negative control that contains only one cell type or spatial domain, allowing for the detection and removal of spurious discoveries caused by double dipping. We demonstrate that ClusterDE controls the FDR and identifies canonical cell-type and spatial-domain markers as top DE genes, distinguishing them from housekeeping genes. ClusterDE’s ability to discover reliable markers, or the absence of such markers, can be used to determine whether two ambiguous clusters should be merged. Additionally, ClusterDE is compatible with state-of-the-art analysis pipelines like Seurat and Scanpy.",
	"DOI": "10.1101/2023.07.21.550107",
	"language": "en",
	"license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
	"publisher": "Bioinformatics",
	"source": "DOI.org (Crossref)",
	"title": "Synthetic control removes spurious discoveries from double dipping in single-cell and spatial transcriptomics data analyses",
	"URL": "http://biorxiv.org/lookup/doi/10.1101/2023.07.21.550107",
	"author": [
		{
			"family": "Song",
			"given": "Dongyuan"
		},
		{
			"family": "Chen",
			"given": "Siqi"
		},
		{
			"family": "Lee",
			"given": "Christy"
		},
		{
			"family": "Li",
			"given": "Kexin"
		},
		{
			"family": "Ge",
			"given": "Xinzhou"
		},
		{
			"family": "Li",
			"given": "Jingyi Jessica"
		}
	],
	"accessed": {
		"date-parts": [
			[
				"2025",
				3,
				6
			]
		]
	},
	"issued": {
		"date-parts": [
			[
				"2023",
				7,
				25
			]
		]
	}
},
	{
		"id": "http://zotero.org/users/local/kNFwy5Yy/items/IWAE2NF6",
		"type": "article-journal",
		"abstract": "Genetic variation can alter brain structure and, consequently, function. Comparative statistical analysis of mouse brains across genetic backgrounds requires spatial, single-cell, atlas-scale data, in replicates—a challenge for current technologies. We introduce Atlas-scale Transcriptome Localization using Aggregate Signatures (ATLAS), a scalable tissue mapping method. ATLAS learns transcriptional signatures from scRNAseq data, encodes them in situ with tens of thousands of oligonucleotide probes, and decodes them to infer cell types and imputed transcriptomes. We validated ATLAS by comparing its cell type inferences with direct MERFISH measurements of marker genes and quantitative comparisons to four other technologies. Using ATLAS, we mapped the central brains of five male and five female C57BL/6J (B6) mice and five male BTBR T+ tf/J (BTBR) mice, an idiopathic model of autism, collectively profiling over 40 million cells across over 400 coronal sections. Our analysis revealed over 40 significant differences in cell type distributions and identified 16 regional composition changes across male-female and B6-BTBR comparisons. ATLAS thus enables systematic comparative studies, facilitating organ-level structure-function analysis of disease models.Competing Interest StatementZH and RW are the co-founders of Biocartography Inc.",
		"container-title": "bioRxiv",
		"DOI": "10.1101/2024.10.08.617260",
		"page": "2024.10.08.617260",
		"title": "Spatial Single-Cell Mapping of Transcriptional Differences Across Genetic Backgrounds in Mouse Brains",
		"URL": "http://biorxiv.org/content/early/2024/10/09/2024.10.08.617260.abstract",
		"author": [
			{
				"family": "Hemminger",
				"given": "Zachary"
			},
			{
				"family": "Sanchez-Tam",
				"given": "Gabriela"
			},
			{
				"family": "De Ocampo",
				"given": "Haley"
			},
			{
				"family": "Wang",
				"given": "Aihui"
			},
			{
				"family": "Underwood",
				"given": "Thomas"
			},
			{
				"family": "Xie",
				"given": "Fangming"
			},
			{
				"family": "Zhao",
				"given": "Qiuying"
			},
			{
				"family":"<b>Song</b>",
                "given":"Dongyuan"
			},
			{
				"family": "Li",
				"given": "Jingyi Jessica"
			},
			{
				"family": "Dong",
				"given": "Hongwei"
			},
			{
				"family": "Wollman",
				"given": "Roy"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2024",
					10,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/kNFwy5Yy/items/65S99XSR",
		"type": "article-journal",
		"abstract": "Spatially resolved transcriptomics offers unprecedented insight by enabling the profiling of gene expression within the intact spatial context of cells, effectively adding a new and essential dimension to data interpretation. To efficiently detect spatial structure of interest, an essential step in analyzing such data involves identifying spatially variable genes. Despite researchers having developed several computational methods to accomplish this task, the lack of a comprehensive benchmark evaluating their performance remains a considerable gap in the field. Here, we present a systematic evaluation of 14 methods using 60 simulated datasets generated by four different simulation strategies, 12 real-world transcriptomics, and three spatial ATAC-seq datasets. We find that spatialDE2 consistently outperforms the other benchmarked methods, and Moran’s I achieves competitive performance in different experimental settings. Moreover, our results reveal that more specialized algorithms are needed to identify spatially variable peaks.Competing Interest StatementThe authors have declared no competing interest.",
		"container-title": "bioRxiv",
		"DOI": "10.1101/2023.12.02.569717",
		"page": "2023.12.02.569717",
		"title": "Benchmarking computational methods to identify spatially variable genes and peaks",
		"URL": "http://biorxiv.org/content/early/2023/12/03/2023.12.02.569717.abstract",
		"author": [
			{
				"family": "Li",
				"given": "Zhijian"
			},
			{
				"family": "M.Patel",
				"given": "Zain"
			},
			{
				"family":"<b>Song</b>",
                "given":"Dongyuan"
			},
			{
				"family": "Yan",
				"given": "Guanao"
			},
			{
				"family": "Li",
				"given": "Jingyi Jessica"
			},
			{
				"family": "Pinello",
				"given": "Luca"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2023",
					12,
					3
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/kNFwy5Yy/items/GRQ9736W",
		"type": "article-journal",
		"abstract": "In single-cell RNA sequencing (scRNA-seq) analysis, a key challenge is inferring hidden cellular dynamics from static cell snapshots. Various computational methods have been developed to address this, focusing on perspectives like pseudotime trajectories, RNA velocities, and estimating the differentiation potential of cells, often referred to as \"cell potency.\" This review summarizes 14 methods for defining cell potency from scRNA-seq data, categorizing them into average-based, entropy-based, and correlation-based methods based on how they summarize gene expression levels into a potency measure. We highlight the key similarities and differences within and between these categories, offering a high-level intuition for each method. Additionally, we use unified mathematical notations to detail each method's methodology and summarize their usage complexities, including parameters, required inputs, and differences between published descriptions and software implementations. We conclude that cell potency estimation remains an open question without a consensus on the optimal approach, emphasizing the need for benchmark datasets and studies. This review aims to provide a foundation for future benchmark studies, while also addressing the broader challenge of comparing methods that infer cellular dynamics from scRNA-seq data through various perspectives, including pseudotime trajectories, RNA velocities, and cell potency.",
		"container-title": "arXiv",
		"DOI": "10.48550/arXiv.2309.13518",
		"journalAbbreviation": "arXiv",
		"title": "Review of computational methods for estimating cell potency from single-cell RNA-seq data, with a detailed analysis of discrepancies between method description and code implementation",
		"URL": "https://doi.org/10.48550/arXiv.2309.13518",
		"author": [
			{
				"family": "Wang",
				"given": "Qingyang"
			},
			{
				"family": "Zhai",
				"given": "Zhiqian"
			},
			{
				"family":"<b>Song</b>",
                "given":"Dongyuan"
			},
			{
				"family": "Li",
				"given": "Jingyi Jessica"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2023",
					9,
					24
				]
			]
		}
	}
]