[
	{
		"id": "http://zotero.org/users/local/kNFwy5Yy/items/IWAE2NF6",
		"type": "article-journal",
		"abstract": "Genetic variation can alter brain structure and, consequently, function. Comparative statistical analysis of mouse brains across genetic backgrounds requires spatial, single-cell, atlas-scale data, in replicates—a challenge for current technologies. We introduce Atlas-scale Transcriptome Localization using Aggregate Signatures (ATLAS), a scalable tissue mapping method. ATLAS learns transcriptional signatures from scRNAseq data, encodes them in situ with tens of thousands of oligonucleotide probes, and decodes them to infer cell types and imputed transcriptomes. We validated ATLAS by comparing its cell type inferences with direct MERFISH measurements of marker genes and quantitative comparisons to four other technologies. Using ATLAS, we mapped the central brains of five male and five female C57BL/6J (B6) mice and five male BTBR T+ tf/J (BTBR) mice, an idiopathic model of autism, collectively profiling over 40 million cells across over 400 coronal sections. Our analysis revealed over 40 significant differences in cell type distributions and identified 16 regional composition changes across male-female and B6-BTBR comparisons. ATLAS thus enables systematic comparative studies, facilitating organ-level structure-function analysis of disease models.Competing Interest StatementZH and RW are the co-founders of Biocartography Inc.",
		"container-title": "bioRxiv",
		"DOI": "10.1101/2024.10.08.617260",
		"page": "2024.10.08.617260",
		"title": "Spatial Single-Cell Mapping of Transcriptional Differences Across Genetic Backgrounds in Mouse Brains",
		"URL": "http://biorxiv.org/content/early/2024/10/09/2024.10.08.617260.abstract",
		"author": [
			{
				"family": "Hemminger",
				"given": "Zachary"
			},
			{
				"family": "Sanchez-Tam",
				"given": "Gabriela"
			},
			{
				"family": "De Ocampo",
				"given": "Haley"
			},
			{
				"family": "Wang",
				"given": "Aihui"
			},
			{
				"family": "Underwood",
				"given": "Thomas"
			},
			{
				"family": "Xie",
				"given": "Fangming"
			},
			{
				"family": "Zhao",
				"given": "Qiuying"
			},
			{
				"family": "Song",
				"given": "Dongyuan"
			},
			{
				"family": "Li",
				"given": "Jingyi Jessica"
			},
			{
				"family": "Dong",
				"given": "Hongwei"
			},
			{
				"family": "Wollman",
				"given": "Roy"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2024",
					10,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/kNFwy5Yy/items/65S99XSR",
		"type": "article-journal",
		"abstract": "Spatially resolved transcriptomics offers unprecedented insight by enabling the profiling of gene expression within the intact spatial context of cells, effectively adding a new and essential dimension to data interpretation. To efficiently detect spatial structure of interest, an essential step in analyzing such data involves identifying spatially variable genes. Despite researchers having developed several computational methods to accomplish this task, the lack of a comprehensive benchmark evaluating their performance remains a considerable gap in the field. Here, we present a systematic evaluation of 14 methods using 60 simulated datasets generated by four different simulation strategies, 12 real-world transcriptomics, and three spatial ATAC-seq datasets. We find that spatialDE2 consistently outperforms the other benchmarked methods, and Moran’s I achieves competitive performance in different experimental settings. Moreover, our results reveal that more specialized algorithms are needed to identify spatially variable peaks.Competing Interest StatementThe authors have declared no competing interest.",
		"container-title": "bioRxiv",
		"DOI": "10.1101/2023.12.02.569717",
		"page": "2023.12.02.569717",
		"title": "Benchmarking computational methods to identify spatially variable genes and peaks",
		"URL": "http://biorxiv.org/content/early/2023/12/03/2023.12.02.569717.abstract",
		"author": [
			{
				"family": "Li",
				"given": "Zhijian"
			},
			{
				"family": "M.Patel",
				"given": "Zain"
			},
			{
				"family": "Song",
				"given": "Dongyuan"
			},
			{
				"family": "Yan",
				"given": "Guanao"
			},
			{
				"family": "Li",
				"given": "Jingyi Jessica"
			},
			{
				"family": "Pinello",
				"given": "Luca"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2023",
					12,
					3
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/kNFwy5Yy/items/8QL9XYQP",
		"type": "article-journal",
		"abstract": "Understanding diverse responses of individual cells to the same perturbation is central to many biological and biomedical problems. Current methods, however, do not precisely quantify the strength of perturbation responses and, more importantly, reveal new biological insights from heterogeneity in responses. Here we introduce the perturbation-response score (PS), based on constrained quadratic optimization, to quantify diverse perturbation responses at a single-cell level. Applied to single-cell transcriptomes of large-scale genetic perturbation datasets (e.g., Perturb-seq), PS outperforms existing methods for quantifying partial gene perturbation responses. In addition, PS presents two major advances. First, PS enables large-scale, single-cell-resolution dosage analysis of perturbation, without the need to titrate perturbation strength. By analyzing the dose-response patterns of over 2,000 essential genes in Perturb-seq, we identify two distinct patterns, depending on whether a moderate reduction in their expression induces strong downstream expression alterations. Second, PS identifies intrinsic and extrinsic biological determinants of perturbation responses. We demonstrate the application of PS in contexts such as T cell stimulation, latent HIV-1 expression, and pancreatic cell differentiation. Notably, PS unveiled a previously unrecognized, cell-type-specific role of coiled-coil domain containing 6 (CCDC6) in guiding liver and pancreatic lineage decisions, where CCDC6 knockouts drive the endoderm cell differentiation towards liver lineage, rather than pancreatic lineage. The PS approach provides an innovative method for dose-to-function analysis and will enable new biological discoveries from single-cell perturbation datasets.One sentence summary We present a method to quantify diverse perturbation responses and discover novel biological insights in single-cell perturbation datasets.",
		"container-title": "bioRxiv",
		"DOI": "10.1101/2023.10.30.564796",
		"page": "2023.10.30.564796",
		"title": "Decoding Heterogenous Single-cell Perturbation Responses",
		"URL": "http://biorxiv.org/content/early/2023/11/29/2023.10.30.564796.abstract",
		"author": [
			{
				"family": "Song",
				"given": "Bicna"
			},
			{
				"family": "Liu",
				"given": "Dingyu"
			},
			{
				"family": "Dai",
				"given": "Weiwei"
			},
			{
				"family": "McMyn",
				"given": "Natalie"
			},
			{
				"family": "Wang",
				"given": "Qingyang"
			},
			{
				"family": "Yang",
				"given": "Dapeng"
			},
			{
				"family": "Krejci",
				"given": "Adam"
			},
			{
				"family": "Vasilyev",
				"given": "Anatoly"
			},
			{
				"family": "Untermoser",
				"given": "Nicole"
			},
			{
				"family": "Loregger",
				"given": "Anke"
			},
			{
				"family": "Song",
				"given": "Dongyuan"
			},
			{
				"family": "Williams",
				"given": "Breanna"
			},
			{
				"family": "Rosen",
				"given": "Bess"
			},
			{
				"family": "Cheng",
				"given": "Xiaolong"
			},
			{
				"family": "Chao",
				"given": "Lumen"
			},
			{
				"family": "Kale",
				"given": "Hanuman T."
			},
			{
				"family": "Zhang",
				"given": "Hao"
			},
			{
				"family": "Diao",
				"given": "Yarui"
			},
			{
				"family": "Bürckstümmer",
				"given": "Tilmann"
			},
			{
				"family": "Siliciano",
				"given": "Jenet M."
			},
			{
				"family": "Li",
				"given": "Jingyi Jessica"
			},
			{
				"family": "Siliciano",
				"given": "Robert"
			},
			{
				"family": "Huangfu",
				"given": "Danwei"
			},
			{
				"family": "Li",
				"given": "Wei"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2023",
					10,
					30
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/kNFwy5Yy/items/GRQ9736W",
		"type": "article-journal",
		"abstract": "In single-cell RNA sequencing (scRNA-seq) analysis, a key challenge is inferring hidden cellular dynamics from static cell snapshots. Various computational methods have been developed to address this, focusing on perspectives like pseudotime trajectories, RNA velocities, and estimating the differentiation potential of cells, often referred to as \"cell potency.\" This review summarizes 14 methods for defining cell potency from scRNA-seq data, categorizing them into average-based, entropy-based, and correlation-based methods based on how they summarize gene expression levels into a potency measure. We highlight the key similarities and differences within and between these categories, offering a high-level intuition for each method. Additionally, we use unified mathematical notations to detail each method's methodology and summarize their usage complexities, including parameters, required inputs, and differences between published descriptions and software implementations. We conclude that cell potency estimation remains an open question without a consensus on the optimal approach, emphasizing the need for benchmark datasets and studies. This review aims to provide a foundation for future benchmark studies, while also addressing the broader challenge of comparing methods that infer cellular dynamics from scRNA-seq data through various perspectives, including pseudotime trajectories, RNA velocities, and cell potency.",
		"container-title": "arXiv:2309.13518v2",
		"DOI": "10.48550/arXiv.2309.13518",
		"journalAbbreviation": "arXiv",
		"title": "Review of computational methods for estimating cell potency from single-cell RNA-seq data, with a detailed analysis of discrepancies between method description and code implementation",
		"URL": "https://doi.org/10.48550/arXiv.2309.13518",
		"author": [
			{
				"family": "Wang",
				"given": "Qingyang"
			},
			{
				"family": "Zhai",
				"given": "Zhiqian"
			},
			{
				"family": "Song",
				"given": "Dongyuan"
			},
			{
				"family": "Li",
				"given": "Jingyi Jessica"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2023",
					9,
					24
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/kNFwy5Yy/items/CPN33H4H",
		"type": "article-journal",
		"abstract": "In typical single-cell RNA-seq (scRNA-seq) data analysis, a clustering algorithm is applied to find putative cell types as clusters, and then a statistical differential expression (DE) test is used to identify the differentially expressed (DE) genes between the cell clusters. However, this common procedure uses the same data twice, an issue known as “double dipping”: the same data is used to define both cell clusters and DE genes, leading to false-positive DE genes even when the cell clusters are spurious. To overcome this challenge, we propose ClusterDE, a post-clustering DE test for controlling the false discovery rate (FDR) of identified DE genes regardless of clustering quality. The core idea of ClusterDE is to generate real-data-based synthetic null data with only one cluster, as a counterfactual in contrast to the real data, for evaluating the whole procedure of clustering followed by a DE test. Using comprehensive simulation and real data analysis, we show that ClusterDE has not only solid FDR control but also the ability to find cell-type marker genes that are biologically meaningful. ClusterDE is fast, transparent, and adaptive to a wide range of clustering algorithms and DE tests. Besides scRNA-seq data, ClusterDE is generally applicable to post-clustering DE analysis, including single-cell multi-omics data analysis.Competing Interest StatementThe authors have declared no competing interest.",
		"container-title": "bioRxiv",
		"DOI": "10.1101/2023.07.21.550107",
		"page": "2023.07.21.550107",
		"title": "ClusterDE: a post-clustering differential expression (DE) method robust to false-positive inflation caused by double dipping",
		"URL": "http://biorxiv.org/content/early/2023/07/25/2023.07.21.550107.abstract",
		"author": [
			{
				"family": "Song",
				"given": "Dongyuan"
			},
			{
				"family": "Li",
				"given": "Kexin"
			},
			{
				"family": "Ge",
				"given": "Xinzhou"
			},
			{
				"family": "Li",
				"given": "Jingyi Jessica"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2023",
					7,
					21
				]
			]
		}
	}
]